#Область ПрограммныйИнтерфейс

//Функция НастройкиПакета(ИмяПакета, ИдентификаторСистемы) Экспорт
//
//	//Если СтрНачинаетсяС(ИмяПакета, ИдентификаторСистемы) Тогда
//		//ИмяДляПоиска = СтрЗаменить(ИмяПакета, ИдентификаторСистемы, "");
//	//Иначе
//		//ИмяДляПоиска = ИмяПакета;
//	//КонецЕсли;
//	
//	НастройкиПакетов = ПолучитьНастройкиПакетов();	
//	
//	Для Каждого Настройка Из НастройкиПакетов Цикл
//		
//		Если СтрНайти(ИмяПакета, Настройка.ИмяПакета) > 0 Тогда
//			
//			// Если пакет индивидуальный, то надо проверить относится ли он к текущей системе
//			Если Не Настройка.Общий 
//				И Не СтрНачинаетсяС(ИмяПакета, ИдентификаторСистемы) Тогда
//				Возврат Неопределено;
//			КонецЕсли;
//			
//			Возврат Настройка;
//		
//		КонецЕсли; 
//		
//	КонецЦикла;
//	
//КонецФункции
//
//Функция ПолучитьНастройкиПакетов() Экспорт 
//	
//	НастройкиПакетов = ИнициализироватьТаблицуНастроекПакетов();
//	
//	ЗаполнитьЗагружаемыеПакеты(НастройкиПакетов);
//		
//	Возврат НастройкиПакетов;
//	
//КонецФункции
//
//Процедура ЗаполнитьЗагружаемыеПакеты(НастройкиПакетов) Экспорт
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"common_mdm_xsd_schema",
//		"MDM", 
//		"mdm_schema.json", 
//		"адаптер_МенеджерПакетов.ЗагрузитьПакетСоСхемойДанныхMDM",
//		,
//		"Рабочая версия формата",
//		,
//		Истина);
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"common_rc_mdm_xsd_schema", 
//		"MDM", 
//		"mdm_schema.json", 
//		"адаптер_МенеджерПакетов.ЗагрузитьПакетСоСхемойДанныхMDM",
//		,
//		"Предрелизная версия формата");
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"common_dev_mdm_xsd_schema", 
//		"MDM", 
//		"mdm_schema.json", 
//		"адаптер_МенеджерПакетов.ЗагрузитьПакетСоСхемойДанныхMDM",
//		,
//		"Фича версия формата");
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"mdm_exchange_module", 
//		"MDM", 		
//		"adapter_ExchangeModule.cfe", 
//		"адаптер_МенеджерПакетов.ЗагрузитьПакетСМодулемМенеджераОбменаMDM",
//		Истина,
//		"Расширение с модулем обмена",
//		Ложь,
//		Ложь);
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"common_mdm_rmq_adapter",
//		"MDM", 		 
//		"adapter_RMQ.cfe", 
//		"адаптер_МенеджерПакетов.ЗагрузитьПакетСАдаптеромMDM",
//		Истина,
//		"Адаптер для работы с MDM",
//		,
//		Истина,
//		9);
//
//	ДобавитьНастройку(НастройкиПакетов, 
//		"2my_package",
//		"Песочница", 
//		"mdm_schema.json", 
//		"адаптер_МенеджерПакетов.МойОбработчик",
//		,
//		"Демо пакет");
//				
//КонецПроцедуры

// Добавить настройку.
// 
// Параметры:
//  НастройкиПакетов - ТаблицаЗначений - Настройки пакетов:
// * ИмяПакета - Строка
// * ИмяФайла - Строка
// * Категория - Строка
// * МетодОбработчик - Строка
// * ТребуетсяПерезагрузка - Булево
// * Описание - Строка
// * Общий - Булево
// * ЗагружатьПоУмолчанию - Булево
//  ИмяПакета - Строка - Имя пакета
//  ИмяФайла - Строка - Имя файла
//  Категория - Строка - Категория пакета
//  МетодОбработчик - Строка - Метод обработчик
//  ТребуетсяПерезагрузка - Булево - Требуется перезагрузка
//  Описание - Строка - Описание
//  Общий - Булево - Признак что пакет является единым для всех систем (Для персональных пакетов вначале пишется имя системы)
//  ЗагружатьПоУмолчанию - Булево - Устанавливать отметку Загружать если есть новые версии пакета
//	ПорядокПрименения - Число - Порядок установки/обновления пакета, где 0 - первый
//Процедура ДобавитьНастройку(
//				НастройкиПакетов, 
//				ИмяПакета,
//				Категория, 
//				ИмяФайла, 
//				МетодОбработчик,
//				ТребуетсяПерезагрузка = Ложь,
//				Описание = "",
//				Общий = Истина,
//				ЗагружатьПоУмолчанию = Ложь,
//				ПорядокПрименения = 0) Экспорт
//		
//	НоваяНастройка = НастройкиПакетов.Добавить();
//	НоваяНастройка.ИмяПакета = ИмяПакета;
//	НоваяНастройка.Категория = Категория;	
//	НоваяНастройка.ИмяФайла = ИмяФайла;
//	НоваяНастройка.МетодОбработчик = МетодОбработчик;
//	НоваяНастройка.ТребуетсяПерезагрузка = ТребуетсяПерезагрузка;
//	НоваяНастройка.Описание = Описание;
//	НоваяНастройка.Общий = Общий;
//	НоваяНастройка.ЗагружатьПоУмолчанию = ЗагружатьПоУмолчанию;
//	НоваяНастройка.ПорядокПрименения = ПорядокПрименения;
//	
//КонецПроцедуры

//Процедура ЗагрузитьПакетСМодулемМенеджераОбменаMDM(ДвоичныеДанные, Результат) Экспорт
//
//	ИмяРасширения = "адаптер_МодульМенеджераОбмена";
//	ИмяБазовогоПакета = "mdm_exchange_module";
//
//	КЭШ = РегистрыСведений.адаптер_УстановленныеПакеты.ВерсииПакетов(Результат.ИмяПакета);
//	НоваяВерсия = РегистрыСведений.адаптер_УстановленныеПакеты.СтруктураЗаписи();
//	НоваяВерсия.Пакет = Результат.ИмяПакета;
//	НоваяВерсия.Версия = Результат.Версия;
//	РегистрыСведений.адаптер_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
//	
//	РезультатЗагрузкиРасширения = ЗагрузитьРасширение(ИмяРасширения, ДвоичныеДанные);
//	
//	Если ЗначениеЗаполнено(РезультатЗагрузкиРасширения) Тогда
//		Результат.ТекстОшибки = РезультатЗагрузкиРасширения;
//		Если КЭШ.Количество() Тогда
//			ЗаполнитьЗначенияСвойств(НоваяВерсия, КЭШ[0]);
//			РегистрыСведений.адаптер_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
//		КонецЕсли;
//	Иначе
//		// Пакет с расширением может быть зарегистрирован только один
//		РегистрыСведений.адаптер_УстановленныеПакеты.УдалитьДублиПакета(Результат.ИмяПакета, ИмяБазовогоПакета);		
//	КонецЕсли;
//	
//КонецПроцедуры
//
//Процедура ЗагрузитьПакетСАдаптеромMDM(ДвоичныеДанные, Результат) Экспорт
//
//	ИмяРасширения = "адаптер_RMQ";
//	
//	КЭШ = РегистрыСведений.пм_УстановленныеПакеты.ВерсииПакетов(Результат.ИмяПакета);
//	НоваяВерсия = РегистрыСведений.пм_УстановленныеПакеты.СтруктураЗаписи();
//	НоваяВерсия.Пакет = Результат.ИмяПакета;
//	НоваяВерсия.Версия = Результат.Версия;
//	РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
//	
//	РезультатЗагрузкиРасширения = ЗагрузитьРасширение(ИмяРасширения, ДвоичныеДанные);
//	
//	Если ЗначениеЗаполнено(РезультатЗагрузкиРасширения) Тогда
//		Результат.ТекстОшибки = РезультатЗагрузкиРасширения;
//		Если КЭШ.Количество() Тогда
//			ЗаполнитьЗначенияСвойств(НоваяВерсия, КЭШ[0]);
//			РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

#Область ОбработчикиУстановкиПакетов

Процедура ЗагрузитьПакетСоСхемойДанныхMDM(ДвоичныеДанные, Результат) Экспорт

	ПакетJSON = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);

	СтруктураПакета = пм_ОбщегоНазначения.ЗначениеИзСтрокиJSON(ПакетJSON);
	
	Модуль = пм_ОбщегоНазначения.ОбщийМодуль("Справочники.адаптер_СхемыДанных");
	
	ДанныеСхемы = Модуль.НайтиПоПространствуИмен(СтруктураПакета.ПространствоИмен); 	
	СхемаДанных = ДанныеСхемы.Ссылка;
	
	Если СхемаДанных = Неопределено Тогда
		// Создаем новую
		ИмяГрупыСхемы = "MDM.Messages";
		ГруппаСхемы = Модуль.НайтиПоНаименованию(ИмяГрупыСхемы, Истина);
		Если Не ЗначениеЗаполнено(ГруппаСхемы) Тогда
			ГруппаСхемыОбъект = Модуль.СоздатьГруппу();
			ГруппаСхемыОбъект.Наименование = ИмяГрупыСхемы;
			Попытка				
				ГруппаСхемыОбъект.Записать();		
				ГруппаСхемы = ГруппаСхемыОбъект.Ссылка; 		
			Исключение
				Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());						
				Возврат;
			КонецПопытки;			
		КонецЕсли;
		
		ТипРелиза = ПредопределенноеЗначение("Перечисление.адаптер_ТипыРелизовВерсийФорматов." + СтруктураПакета.ТипРелиза);
			
		ПараметрыСхемы = Новый Структура;
		ПараметрыСхемы.Вставить("Наименование", СтруктураПакета.Наименование);
		ПараметрыСхемы.Вставить("Родитель", ГруппаСхемы);
		ПараметрыСхемы.Вставить("ПространствоИмен", СтруктураПакета.ПространствоИмен);
		ПараметрыСхемы.Вставить("Версия", СтруктураПакета.Версия);		
		ПараметрыСхемы.Вставить("ТипРелиза", ТипРелиза);
		ПараметрыСхемы.Вставить("Описание", СтруктураПакета.Описание);
		ПараметрыСхемы.Вставить("ТекстСхемы", СтруктураПакета.ТекстСхемы);
		ПараметрыСхемы.Вставить("ДатаЗагрузки", ТекущаяДатаСеанса());

		СхемаДанных = Модуль.СоздатьСхемуДанных(ПараметрыСхемы);		
	Иначе
		Модуль.ИзменитьТекстСхемы(СхемаДанных, СтруктураПакета.ТекстСхемы);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗагрузитьПакетСРасширением(ДвоичныеДанные, Результат) Экспорт
		
	РезультатЗагрузкиРасширения = ЗагрузитьРасширение(ДвоичныеДанные);
	
	Если ЗначениеЗаполнено(РезультатЗагрузкиРасширения) Тогда
		Результат.ТекстОшибки = РезультатЗагрузкиРасширения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДемоПакет(ДвоичныеДанные, Результат) Экспорт
	
	пм_ОбщегоНазначения.СообщитьПользователю("Обработчик загрузки демо пакета выполнен.");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализировать таблицу настроек пакетов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -- Инициализировать таблицу настроек пакетов::
// * ИмяПакета - Строка -
// * ИмяФайла - Строка -
// * МетодОбработчик - Строка -
// * ТребуетсяПерезагрузка - Булево -
// * Описание - Строка -
// * Общий - Булево -
// * ЗагружатьПоУмолчанию - Булево - Устанавливать отметку Загружать если есть новые версии пакета
// * ПорядокПрименения - Число - Порядок установки/обновления пакета, где 0 - первый
//Функция ИнициализироватьТаблицуНастроекПакетов()
//	
//	ТаблицаНастроек = Новый ТаблицаЗначений;
//	ТаблицаНастроек.Колонки.Добавить("ИмяПакета", Новый ОписаниеТипов("Строка"));
//	ТаблицаНастроек.Колонки.Добавить("Категория", Новый ОписаниеТипов("Строка"));
//	ТаблицаНастроек.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
//	ТаблицаНастроек.Колонки.Добавить("МетодОбработчик", Новый ОписаниеТипов("Строка"));
//	ТаблицаНастроек.Колонки.Добавить("ТребуетсяПерезагрузка", Новый ОписаниеТипов("Булево"));
//	ТаблицаНастроек.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
//	ТаблицаНастроек.Колонки.Добавить("Общий", Новый ОписаниеТипов("Булево"));
//	ТаблицаНастроек.Колонки.Добавить("ЗагружатьПоУмолчанию", Новый ОписаниеТипов("Булево"));
//	ТаблицаНастроек.Колонки.Добавить("ПорядокПрименения", Новый ОписаниеТипов("Число"));
//	
//	Возврат ТаблицаНастроек;
//	
//КонецФункции

Функция ЗагрузитьРасширение(ДвоичныеДанные)	
	
	РезультатУстановки = пм_УстановщикРасширений.УстановитьИзДвоичныхДанных(ДвоичныеДанные);
	Если РезультатУстановки.Успешно Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатУстановки.ТекстОшибки;
	
КонецФункции

Функция НайтиРасширение(ИмяРасширения)
	
	Возврат пм_ОбщегоНазначения.НайтиРасширение(ИмяРасширения);
	
КонецФункции

Процедура ОтключитьПредупрежденияБезопасности(Расширение)

	ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	Расширение.ЗащитаОтОпасныхДействий = ОписаниеЗащиты;
	
КонецПроцедуры

Процедура ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение)
	
	//@skip-check property-not-writable
	Расширение.ИспользоватьОсновныеРолиДляВсехПользователей = Ложь;
	
КонецПроцедуры

#КонецОбласти






