
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	ВосстановитьНастройки();
	
	НастроитьЭлементыФормы();
						
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("ОбновитьДанныеНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияЗаполнитеИдентификаторСистемыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройки" Тогда
		ОткрытьФормуНастроек();		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКатегории

&НаКлиенте
Процедура РазделыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбработкаОжиданияУстановкиФильтраПакетов", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПакеты

&НаКлиенте
Процедура ПакетыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбработкаОжиданияУстановкиФильтраВерсий", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьСтроки(Команда)
	
	УстановитьОтметку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСтрок(Команда)
	
	УстановитьОтметку(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьДанныеНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)

	ТекущаяСтрока = Элементы.Версии.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;	
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВопросСкачатьУстановитьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = НСтр("ru = 'Скачать и установить выбранную версию пакета?'");
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ОткрытьФормуНастроек();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНастроек()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛимитВерсий", ЛимитВерсий);
	ПараметрыФормы.Вставить("ИдентификаторСистемы", ИдентификаторСистемы);
	
	ОткрытьФорму(
		"Обработка.пм_МенеджерПакетов.Форма.Настройки", 
		ПараметрыФормы,
		ЭтотОбъект,,,, Новый ОписаниеОповещения("ИзменитьНастройкиНаКлиентеЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаКлиенте()
	
	 ДлительнаяОперация = ЗагрузитьСписокПакетов();
	 
	 ДополнительныеПараметры = Новый Структура;
	 ДополнительныеПараметры.Вставить("КлючСтрокиПакеты", КлючТекущейСтроки("Пакеты", "Имя"));
	 ДополнительныеПараметры.Вставить("КлючСтрокиКатегории", КлючТекущейСтроки("Категории", "Наименование"));
	 
	 ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииСпискаПакетов", ЭтотОбъект, ДополнительныеПараметры);
	 ПараметрыОжидания = пм_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	 
	 пм_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьСписокПакетов()

	ПараметрыВыполнения = пм_ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение списка пакетов из менеджера пакетов'");
		
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ЛимитВерсий", ЛимитВерсий);
	ПараметрыКоманды.Вставить("ИдентификаторСистемы", ИдентификаторСистемы);
	ПараметрыКоманды.Вставить("ФильтрВерсий", ФильтрВерсий);
		
	ИмяМетода = "Обработки.пм_МенеджерПакетов.ДанныеМенеджераПакетов";
	
	Возврат пм_ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, ПараметрыКоманды);
	
КонецФункции

&НаСервере
Процедура ПриПолученииСпискаПакетовНаСервере(АдресРезультата)

	ОтветСервиса = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ОтветСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Категории.Загрузить(ОтветСервиса.Категории);
	Пакеты.Загрузить(ОтветСервиса.Пакеты);
	Версии.Загрузить(ОтветСервиса.Версии);	
	
КонецПроцедуры 
    
&НаКлиенте
Процедура ПриПолученииСпискаПакетов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат.Статус <> "Выполнено" Тогда 
		Возврат;
	КонецЕсли;

	ПриПолученииСпискаПакетовНаСервере(Результат.АдресРезультата);
	
	ВосстановитьТекущуюСтроку("Категории", ДополнительныеПараметры.КлючСтрокиКатегории);
	ВосстановитьТекущуюСтроку("Пакеты", ДополнительныеПараметры.КлючСтрокиПакеты);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтметку(ЗначениеОтметки)
	
	Для Каждого Строка Из Пакеты Цикл
		
		Строка.Загружать = ЗначениеОтметки;
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияУстановкиФильтраВерсий()
	
	Строка = Элементы.Пакеты.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяПакета", Строка.Имя);
	Элементы.Версии.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияУстановкиФильтраПакетов()
	
	Строка = Элементы.Категории.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	Если Не Строка.Наименование = "Все" Тогда
		СтруктураПоиска.Вставить("Категория", Строка.Наименование);
	КонецЕсли;
	Элементы.Пакеты.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСкачатьУстановитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторСтроки = Элементы.Версии.ТекущаяСтрока;			
	АдресРезультата = СкачатьВерсиюПакетаНаСервере(ИдентификаторСтроки);

	ОбработатьРезультатЗагрузки(АдресРезультата);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиНаКлиентеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанные = ИдентификаторСистемы <> Результат.ИдентификаторСистемы;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);

	НастроитьЭлементыФормы();
	
	Если ОбновитьДанные Тогда
		ОбновитьДанныеНаКлиенте();
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Функция КлючТекущейСтроки(ИмяТаблицы, ПоляКлюча)
	
	КлючСтроки = Новый Структура(ПоляКлюча);
	
	ТекущаяСтрока = Элементы[ИмяТаблицы].ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока);
		Если ТекущиеДанные <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(КлючСтроки, ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючСтроки;
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьТекущуюСтроку(ИмяТаблицы, КлючСтроки)

	МассивСтрок = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(КлючСтроки);
	Если МассивСтрок.Количество() > 0 Тогда
		Элементы[ИмяТаблицы].ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СкачатьВерсиюПакетаНаСервере(ИдентификаторСтроки)

	УстановитьПривилегированныйРежим(Истина);

	СтрокаВерсии = Версии.НайтиПоИдентификатору(ИдентификаторСтроки);
					
	МассивСтрок = Пакеты.НайтиСтроки(Новый Структура("Имя", СтрокаВерсии.ИмяПакета));
	СтрокаПакета = МассивСтрок[0];
	
	ПараметрыЗагрузки = Обработки.пм_МенеджерПакетов.НовыеПараметрыЗагрузкиПакета();
	ПараметрыЗагрузки.Вставить("ИмяПакета", СтрокаПакета.Имя);
	ПараметрыЗагрузки.Вставить("МетодОбработчик", СтрокаПакета.МетодОбработчик);
	ПараметрыЗагрузки.Вставить("Версия", СтрокаВерсии.Номер);
	ПараметрыЗагрузки.Вставить("ИмяФайла", СтрокаВерсии.ИмяФайла);
	ПараметрыЗагрузки.Вставить("ТребуетсяПерезагрузка", Ложь);
	
	ПараметрыЗагрузкиПакетов = Новый Массив;	
	ПараметрыЗагрузкиПакетов.Добавить(ПараметрыЗагрузки);
						
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Обработки.пм_МенеджерПакетов.ЗагрузитьАктуальныеВерсииПакетов(
		ПараметрыЗагрузкиПакетов, АдресРезультата);
	
	Возврат АдресРезультата;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗагрузки(АдресХранилища)

	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилища);

	ШаблонСообщенияОбОшибке = НСтр("ru='Ошибка установки пакета %1.
		|Причина: %2'");
	
	ЕстьТребующиеПерезагрузки = Ложь;		
	Сообщения = Новый Массив;
	УстановленоПакетов = 0;
	
	Для Каждого СостояниеЗагрузки Из РезультатЗагрузки Цикл
		Если ЗначениеЗаполнено(СостояниеЗагрузки.ТекстОшибки) Тогда
			ТекстОшибки = пм_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияОбОшибке, СостояниеЗагрузки.ИмяПакета, СокрЛП(СостояниеЗагрузки.ТекстОшибки));
			Сообщения.Добавить(ТекстОшибки);
		Иначе
			УстановленоПакетов = УстановленоПакетов + 1;
			МассивСтрок = Пакеты.НайтиСтроки(Новый Структура("Имя", СостояниеЗагрузки.ИмяПакета));
			Если МассивСтрок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПакета = МассивСтрок[0];
			СтрокаПакета.УстановленнаяВерсия = СостояниеЗагрузки.Версия;
			
			Если СтрокаПакета.ТребуетсяПерезагрузка Тогда
				ЕстьТребующиеПерезагрузки = Истина;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;

	Если ЕстьТребующиеПерезагрузки Тогда
		Если Сообщения.Количество() = 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПерезапускСеансаПослеЗагрузкиЗавершение", ЭтотОбъект),
				"Загрузка успешно завершена. Для применения изменений нужно перезапустить сеанс. Перезапустить?",
				РежимДиалогаВопрос.ДаНет);
		Иначе
			Сообщения.Добавить(НСтр("ru = 'Имеются установленные пакеты для применения которых требуется перезапуск сеанса.
			|Автоматический перезапуск отменен из-за наличия ошибок при установке других пакетов.'"));	
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОповещения = Новый Структура("Сообщения,УстановленоПакетов");
	СтруктураОповещения.Сообщения = Сообщения;
	СтруктураОповещения.УстановленоПакетов = УстановленоПакетов;
	
	ОповеститьПользователяОРезультатеУстановки(СтруктураОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПользователяОРезультатеУстановки(СтруктураОповещения)
	
	УстановленоПакетов = 0;
	
	Если СтруктураОповещения.Свойство("УстановленоПакетов", УстановленоПакетов) И УстановленоПакетов > 0 Тогда
	
		ТекстУстановлено = пм_ОбщегоНазначенияКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'Установлен'"), НСтр("ru = 'Установлено'"), НСтр("ru = 'Установлено'"), УстановленоПакетов);
		ТекстПакеты = пм_ОбщегоНазначенияКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'пакет'"), НСтр("ru = 'пакета'"), НСтр("ru = 'пакетов'"), УстановленоПакетов);
		
		ТекстСообщения = НСтр("ru = '%Установлено% %КоличествоУстановленых% %пакетов%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Установлено%", ТекстУстановлено);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоУстановленых%", УстановленоПакетов);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%пакетов%", ТекстПакеты);

		ТекстЗаголовка = НСтр("ru = 'Установка завершена'");
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не установлен ни один пакет'");
		ТекстЗаголовка = НСтр("ru = 'Установка завершена'");
		
	КонецЕсли;
	ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация);
	
	Если СтруктураОповещения.Свойство("Сообщения") И ЗначениеЗаполнено(СтруктураОповещения.Сообщения) Тогда
		
		ОчиститьСообщения();
		Для каждого ТекстСообщения Из СтруктураОповещения.Сообщения Цикл
			пм_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиПриОтветеНаВопрос(РезультатВопроса, ПредставлениеОшибки) Экспорт
	
	Если РезультатВопроса <> "Подробнее" Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.пм_МенеджерПакетов.Форма.СообщенияОбОшибках", Новый Структура("Текст", ПредставлениеОшибки));	

КонецПроцедуры

&НаКлиенте
Процедура ПерезапускСеансаПослеЗагрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИдентификаторСистемы()

	Если РасширениеАдаптераМДМУстановлено() Тогда
		МодульАдаптераОбщегоНазначенияСервер = пм_ОбщегоНазначения.ОбщийМодуль("адаптер_ОбщегоНазначенияСервер");
		Если МодульАдаптераОбщегоНазначенияСервер = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИдентификаторСистемы = МодульАдаптераОбщегоНазначенияСервер.ИдентификаторСистемы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасширениеАдаптераМДМУстановлено()

	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "адаптер_RMQ"),
		ИсточникРасширенийКонфигурации.СеансАктивные);

	Если Не ЗначениеЗаполнено(Расширения) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервере
Процедура СохранитьНастройки()
	
	Настройки = Новый Соответствие;
	Настройки.Вставить("ФильтрВерсий", ФильтрВерсий);
	Настройки.Вставить("ЛимитВерсий", ЛимитВерсий);
	Настройки.Вставить("ИдентификаторСистемы", ИдентификаторСистемы);
	Настройки.Вставить("URLСервера", URLСервера);
	Настройки.Вставить("ПутьПроекта", ПутьПроекта);
	Настройки.Вставить("IDПроекта", IDПроекта);
	Настройки.Вставить("ИмяПакета", ИмяПакета);
	Настройки.Вставить("ВерсияПакета", ВерсияПакета);
	Настройки.Вставить("ИмяФайлаПакета", ИмяФайлаПакета);
	Настройки.Вставить("ИмяРасширенияВИБ", ИмяРасширенияВИБ);
	Настройки.Вставить("ТокенДоступа", ТокенДоступа);
	
	пм_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.пм_МенеджерПакетов", "Настройки", Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()

	ЗначениеНастроек = пм_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.пм_МенеджерПакетов", "Настройки");
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
		
		ФильтрВерсий = ЗначениеНастроек.Получить("ФильтрВерсий");
		ЛимитВерсий = ЗначениеНастроек.Получить("ЛимитВерсий");
		ИдентификаторСистемы = ЗначениеНастроек.Получить("ИдентификаторСистемы");
		URLСервера = ЗначениеНастроек.Получить("URLСервера");
		ПутьПроекта = ЗначениеНастроек.Получить("ПутьПроекта");
		IDПроекта = ЗначениеНастроек.Получить("IDПроекта");
		ИмяПакета = ЗначениеНастроек.Получить("ИмяПакета");
		ВерсияПакета = ЗначениеНастроек.Получить("ВерсияПакета");
		ИмяФайлаПакета = ЗначениеНастроек.Получить("ИмяФайлаПакета");
		ИмяРасширенияВИБ = ЗначениеНастроек.Получить("ИмяРасширенияВИБ");
		ТокенДоступа = ЗначениеНастроек.Получить("ТокенДоступа");
			
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЛимитВерсий) Тогда
		ЛимитВерсий = 5;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(URLСервера) Тогда
		URLСервера = "https://gitlab.gloria.aaanet.ru";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПутьПроекта) Тогда
		ПутьПроекта = "1s8-enterprise/1c-pipeline-sandbox";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(IDПроекта) Тогда
		IDПроекта = 884;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяПакета) Тогда
		ИмяПакета = "package-manager";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВерсияПакета) Тогда
		ВерсияПакета = "package-manager-v0.1.3";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяФайлаПакета) Тогда
		ИмяФайлаПакета = "demo-extension.cfe";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяРасширенияВИБ) Тогда
		ИмяРасширенияВИБ = "_ДемоРасширение";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ФильтрВерсий) Тогда
		ФильтрВерсий = Элементы.ФильтрВерсий.СписокВыбора[0].Значение;
	КонецЕсли;
		
	ОпределитьИдентификаторСистемы();	

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()

	Элементы.ГруппаДекорацияЗаполнитеИдентификаторСистемы.Видимость = Не ЗначениеЗаполнено(ИдентификаторСистемы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Пакеты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пакеты.Версия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Пакеты.УстановленнаяВерсия");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Категории.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Категории.Наименование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Все";

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));

КонецПроцедуры

#КонецОбласти
