#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЛимитВерсий", ЛимитВерсий);
	Параметры.Свойство("ИдентификаторСистемы", ИдентификаторСистемы);
	Параметры.Свойство("URLСервера", URLСервера);
	Параметры.Свойство("ПутьПроекта", ПутьПроекта);
	Параметры.Свойство("IDПроекта", IDПроекта);
	Параметры.Свойство("ИмяПакета", ИмяПакета);
	Параметры.Свойство("ВерсияПакета", ВерсияПакета);
	Параметры.Свойство("ИмяФайлаПакета", ИмяФайлаПакета);
	Параметры.Свойство("ИмяРасширенияВИБ", ИмяРасширенияВИБ);
	Параметры.Свойство("ТокенДоступа", ТокенДоступа);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура КоличествоОтображаемыхВерсийПакетаПриИзменении(Элемент)
//
//	КоличествоОтображаемыхВерсийПакетаПриИзмененииНаСервере();
//	Оповестить("Запись_НаборКонстант", Новый Структура, "пм_КоличествоОтображаемыхВерсийПакета");
//
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	Результат = Новый Структура;
	Результат.Вставить("ЛимитВерсий", ЛимитВерсий);
	Результат.Вставить("ИдентификаторСистемы", ИдентификаторСистемы);
	Результат.Вставить("URLСервера", URLСервера);
	Результат.Вставить("ПутьПроекта", ПутьПроекта);
	Результат.Вставить("IDПроекта", IDПроекта);
	Результат.Вставить("ИмяПакета", ИмяПакета);
	Результат.Вставить("ВерсияПакета", ВерсияПакета);
	Результат.Вставить("ИмяФайлаПакета", ИмяФайлаПакета);
	Результат.Вставить("ИмяРасширенияВИБ", ИмяРасширенияВИБ);
	Результат.Вставить("ТокенДоступа", ТокенДоступа);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура КоличествоОтображаемыхВерсийПакетаПриИзмененииНаСервере()
//
//	СохранитьЗначениеКонстанты(
//		"пм_КоличествоОтображаемыхВерсийПакета", 
//		НаборКонстант.пм_КоличествоОтображаемыхВерсийПакета)
//
//КонецПроцедуры
//
//&НаСервере
//Процедура СохранитьЗначениеКонстанты(Имя, Значение)
//
//	Если Константы[Имя].Получить() <> Значение Тогда
//		Константы[Имя].Установить(Значение);
//	КонецЕсли;
//
//КонецПроцедуры

#КонецОбласти
