#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ЛимитВерсий", ЛимитВерсий);
	ОбновлятьОтмеченныеПоРасписанию = пм_ПроверкаОбновлений.ОбновлятьОтмеченныеПоРасписанию();
	ПрочитатьРасписаниеЗадания();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	ЗаписатьНастройкиНаСервере();

	Результат = Новый Структура;
	Результат.Вставить("ЛимитВерсий", ЛимитВерсий);

	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)

	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;

	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Диалог.Показать(Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(НовоеРасписание, ДополнительныеПараметры) Экспорт

	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РасписаниеРегламентногоЗадания = НовоеРасписание;
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьРасписаниеЗадания()

	Задание = пм_ПроверкаОбновлений.РегламентноеЗаданиеМенеджера();
	Если Задание = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		ПредставлениеРасписания = НСтр("ru = 'Регламентное задание не найдено'");
		Возврат;
	КонецЕсли;

	РасписаниеРегламентногоЗадания = Задание.Расписание;
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()

	пм_ПроверкаОбновлений.УстановитьОбновлятьОтмеченныеПоРасписанию(
		ОбновлятьОтмеченныеПоРасписанию);

	УстановитьПривилегированныйРежим(Истина);
	пм_ПроверкаОбновлений.ЗаписатьРасписаниеЗадания(
		ОбновлятьОтмеченныеПоРасписанию, РасписаниеРегламентногоЗадания);

КонецПроцедуры

#КонецОбласти
