
#Область ПрограммныйИнтерфейс

Функция ТокенДоступаРепозиторияПакетов() Экспорт

	// MVP работает с публичными источниками без токена.
	// Для приватных источников токен должен храниться в настройках, а не в коде.
	Возврат "";

КонецФункции

Функция АдресAPI_Packages() Экспорт

	Возврат URLСервераGitLab()
		+ "/api/v4/projects/"
		+ ИдентификаторРепозиторияМенеджераПакетов()
		+ "/packages";

КонецФункции

Функция АдресAPI_Repository() Экспорт

	Возврат URLСервераGitLab()
		+ "/api/v4/projects/"
		+ ИдентификаторРепозиторияМенеджераПакетов()
		+ "/repository";

КонецФункции

Функция URLСервераGitLab() Экспорт
	
	Возврат "https://gitlab.com";

КонецФункции

Функция ИдентификаторРепозиторияМенеджераПакетов() Экспорт
	
	// TODO: заменить на значение из справочника пм_ИсточникиПакетов.
	Возврат "";

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХостСервисаGitlab()
	
	Возврат СтрЗаменить(URLСервераGitLab(), "https://", "");

КонецФункции

#КонецОбласти
