#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем пм_ПараметрыПриложения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПриНачалеРаботыСистемы")
Процедура пм_ПриНачалеРаботыСистемы()
	#Если Не МобильныйКлиент Тогда
	пм_ОбщегоНазначенияКлиент.ПриНачалеРаботыСистемы();	
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область Инициализация
пм_ПараметрыПриложения = Новый Соответствие;
#КонецОбласти