
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли

&После("УстановкаПараметровСеанса")
Процедура пм_УстановкаПараметровСеанса(ИменаПараметровСеанса)

	Если ИменаПараметровСеанса <> Неопределено
	   И ИменаПараметровСеанса.Найти("пм_ПараметрыКлиентаНаСервере") <> Неопределено Тогда

		ПараметрыСеанса.пм_ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);

	КонецЕсли;

КонецПроцедуры

